Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 58, 58, 64)        200768    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 29, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 27, 27, 64)        36928     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 128)       73856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 25, 256)       295168    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 23, 23, 256)       590080    
_________________________________________________________________
flatten_1 (Flatten)          (None, 135424)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                9208900   
=================================================================
Total params: 10,599,684
Trainable params: 10,599,684
Non-trainable params: 0
_________________________________________________________________
Train on 10602 samples, validate on 1872 samples

[15.361912018842133, 0.046915167114268845]

batchSize = 32
epochs = 20
RMSprop
-- 3
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 58, 58, 64)        200768    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 29, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 27, 27, 64)        36928     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 128)       73856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 25, 256)       295168    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 23, 23, 256)       590080    
_________________________________________________________________
flatten_1 (Flatten)          (None, 135424)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                9208900   
=================================================================
Total params: 10,599,684
Trainable params: 10,599,684
Non-trainable params: 0
_________________________________________________________________
Train on 10602 samples, validate on 1871 samples

batchSize = 128
epochs = 20
[10.979912623035265, 0.12339331627198541]
RMSprop
--4 
[9.61236097938136, 0.1328626445306893]
adam optimizer
--5
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 58, 58, 64)        200768    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 29, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 29, 29, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 27, 27, 64)        36928     
_________________________________________________________________
dropout_2 (Dropout)          (None, 27, 27, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 128)       73856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 25, 25, 128)       147584    
_________________________________________________________________
dropout_3 (Dropout)          (None, 25, 25, 128)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 25, 256)       295168    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 23, 23, 256)       590080    
_________________________________________________________________
flatten_1 (Flatten)          (None, 135424)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                9208900   
=================================================================
Total params: 10,599,684
Trainable params: 10,599,684
Non-trainable params: 0
_________________________________________________________________
Train on 10601 samples, validate on 1871 samples

[8.38934081735556, 0.10313901342427707]
-added dropouts

--6
[9.511009649407642, 0.1558691469368222]
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 58, 58, 64)        200768    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 29, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 29, 29, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 29, 29, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 27, 27, 64)        36928     
_________________________________________________________________
dropout_2 (Dropout)          (None, 27, 27, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 27, 27, 128)       73856     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 27, 27, 256)       295168    
_________________________________________________________________
flatten_1 (Flatten)          (None, 186624)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                12690500  
=================================================================
Total params: 13,343,620
Trainable params: 13,343,620
Non-trainable params: 0
_________________________________________________________________
Train on 10602 samples, validate on 1871 samples

--7
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 64)        9472      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 64)        36928     
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 128)       73856     
_________________________________________________________________
dropout_3 (Dropout)          (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 256)       295168    
_________________________________________________________________
flatten_1 (Flatten)          (None, 262144)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                17825860  
=================================================================
Total params: 18,241,284
Trainable params: 18,241,284
Non-trainable params: 0
_________________________________________________________________
Train on 10598 samples, validate on 1871 samples

in continuare overfitting

--8
[2.9188426576061897, 0.2601156069459866]
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 64)        9472      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 64)          36928     
_________________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 128)         73856     
_________________________________________________________________
dropout_3 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 68)                139332    
=================================================================
Total params: 259,588
Trainable params: 259,588
Non-trainable params: 0

dropout 0.5

-- 9
dropout 0.6
epochs 100
[2.727719475781023, 0.2841565105645912]
-- 10
[2.917946684249736, 0.2614546620341609]
added img generator
val closer to train, but underfitting now
--11
added batch norm
[2.556787643573268, 0.34658544411946657]
--12 
incredead conv2
[2.5326014738816482, 0.3682692307692308, 0.6782051282051282]
--13
added another conv2
[2.7608813558415215, 0.30554664961494443, 0.6293683873991739]
--14
[2.9652125062872132, 0.2797561758578799, 0.5976900866504353]